Autodesk.Revit.DB.IGetLocalPathForOpenCallbackProxy.GetLocalPathForOpen(Autodesk.Revit.DB.ExternalResourceReference)
Implement this method to specify the local path from where a copy of a Revit link external resource can be opened
for modification without interfering with its use as a link in other open documents.
desiredResource:
The ExternalResourceReference that needs to be opened for modification by Revit.
Returns:
The local path from where Revit can open the linked file as its own top-level document.
Since:
2015